app/Controllers/Home.php

    public function index(): string
    {


        $usuarios = new \App\Models\ViajesModel();
        $data['usuario'] = $usuarios->find(4);
---
SELECT *
FROM `Viajes`
WHERE `Viajes`.`Viaje_id` = 4