app/Controllers/Home.php

    public function index(): string
    {


        $usuarios = new \App\Models\RutaEstacionesModel();
        $data['usuario'] = $usuarios->find(4);
---
SELECT *
FROM `RutaEstaciones`
WHERE `RutaEstaciones`.`ruta_estacion_id` = 4
SELECT *
FROM `Usuarios`
WHERE `Usuarios`.`usuario_id` = 4